import news1 from "../assets/img/newsContentImage/news1.jpg";
import news2 from "../assets/img/newsContentImage/news2.jpg";
import news3 from "../assets/img/newsContentImage/news3.png";
import news4 from "../assets/img/newsContentImage/news4.jpg";
import news5 from "../assets/img/newsContentImage/news5.jpg";
import news6 from "../assets/img/newsContentImage/shahoikoDR.jpg";
import { Image } from "@chakra-ui/react";
export const newscontent = [
  {
    text: `Наша академія від щирого серця хоче привітати Шагойко Юрія Васильовича з Днем народження!! Бажаємо міцного здоров'я, мирного неба над головою, побільше світлих днів і любові, успіхів на татамі і в боротьбі!`,
    image: news6,
  },
  {
    text: `Джиу-джитсу для дітей: Ключ до Фізичного та Розумового Розвитку
    Джиу-джитсу - це не просто спорт, це стиль життя, який може допомогти дітям розвиватись фізично та розумово. Якщо ви шукаєте засіб покращити здоров'я, самодисципліну та впевненість у себе для своєї дитини, джиу-джитсу є ідеальним вибором. У цій статті ми детально розглянемо всі переваги занять джиу-джитсу для дітей та як цей вид спорту може допомогти вашій дитині досягти високих результатів.
    
    Фізичний Розвиток
    Розвиток Сили та Витривалості
    Практика джиу-джитсу сприяє розвитку м'язової сили та витривалості у дітей. Через систематичні тренування, ваша дитина зможе покращити свою фізичну форму та здатність до подолання фізичних завдань.
    
    Розвиток Гнучкості та Координації
    Гнучкість та координація грають важливу роль у фізичному розвитку дітей. Під час занять джиу-джитсу діти виконають різноманітні вправи та техніки, що сприятимуть покращенню їх гнучкості та координації рухів.
    
    Розвиток Самодисципліни та Концентрації
    Джиу-джитсу вимагає від дітей не тільки фізичної, а й розумової праці. Під час тренувань діти навчаться контролювати свої дії, вчитимуться працювати над власними недоліками та розвиватимуть внутрішню самодисципліну.
    
    Розвиток Самооборони та Впевненості
    Джиу-джитсу - це не лише спортивний напрямок, а й навички самооборони. Ваша дитина навчиться застосовувати техніки джиу-джитсу для захисту себе в небезпечних ситуаціях. Це допоможе їй відчувати себе впевнено та захищено.
    
    Командний Дух та Соціальні Зв'язки
    Заняття джиу-джитсу сприяють розвитку командного духу та підтримці групової взаємодії. Діти вчаться спілкуватися, вирішувати конфлікти та працювати разом для досягнення спільних цілей.
    
    Заключні Думки
    Джиу-джитсу - це більше, ніж просто спорт. Це можливість для дітей розвиватись фізично, розумово та емоційно. Воно надає їм навички, які будуть корисними у житті: самодисципліну, впевненість, навички самооборони та багато інших. Якщо ви шукаєте спосіб підтримати здоровий розвиток вашої дитини, джиу-джитсу - це ідеальний вибір.
    
    Як видно, джиу-джитсу має багато позитивних аспектів для фізичного, розумового та емоційного розвитку дітей. Цей вид спорту сприяє зміцненню тіла та духу, навчає важливим життєвим навичкам та допомагає впоратися з різноманітними викликами.
    
    Не вагайтеся - дайте вашій дитині можливість спробувати джиу-джитсу і переконайтеся в усіх його перевагах самі!
    
    Зацікавлені в Джиу-Джитсу?
    Якщо ви зацікавлені в тому, щоб ваша дитина вивчила навички джиу джитсу та отримала гармонійний розвиток
     розуму та тіла, то не вагайтесь - звертайтесь до нашої академії. Ми маємо спеціалізовано оснащений зал для тренувань і окремі вікові групи для дітей від 6 та 10 років відповідно. Але найголовніша перевага нашої академії - авторська методика тренувань, яка дозволить долучитись до процесу тренувань в будь який момент та відносно легко влитись у змагальний процес. Тож не зволікайте та приходьте до нашої академії вже зараз.`,
    image: news1,
  },
  {
    text: ` 29 липня 2023 року в місті Кропивницький відбувся турнір UKRAINE BJJ PRO SUMMER CUP 2023, в якому взяла участь наша команда у складі дитячого дивізіону.
    Маємо наступні результати:
    
    BOYS GI / WHITE, GREY BELTS / KIDS II (7 Y.O.) / 25 KG
    ВОЛОДИМИР ЗАІКА 3-є місце
    
    BOYS GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 51,5+ KG
    ВІКТОР АНДРІЄНК 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 48 KG
    НАЗАР ПОПОВ 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 56 KG
    МИХАЙЛО САМЧЕНКО 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / TEEN (15 Y.O.) / 48 KG
    АРТЕМ САВІН 3-є місце
    
    BOYS NO-GI / WHITE, GREY BELTS / INFANT (11 Y.O.) / 51.5+ KG
    ВІКТОР АНДРІЄНКО 2-є місце
    
    BOYS NO-GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 48 KG
    НАЗАР ПОПОВ 1-е місце
    
    BOYS NO-GI / WHITE, GREY BELTS / JUNIOR (13 Y.O.) / 52 KG
    МИХАЙЛО САМЧЕНКО 2-є місце
    
    GIRLS GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 33 KG
    ЮЛИЯ ГЕТЬМАНЕЦ 1-е місце
    ИЗАБЕЛЛА ЕЛЬНИКОВА 2-є місце
    
    GIRLS GI / WHITE, GREY BELTS / INFANT (11 Y.O.) / 42 KG
    ОЛЕКСАНДРА ШКУРО 3-є місце
    
    GIRLS NO-GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 30 KG
    ЮЛИЯ ГЕТЬМАНЕЦ 1-е місце
    ИЗАБЕЛЛА ЕЛЬНИКОВА 2-є місце 29 липня 2023 року в місті Кропивницький відбувся турнір UKRAINE BJJ PRO SUMMER CUP 2023, в якому взяла участь наша команда у складі дитячого дивізіону.
    Маємо наступні результати:
    
    BOYS GI / WHITE, GREY BELTS / KIDS II (7 Y.O.) / 25 KG
    ВОЛОДИМИР ЗАІКА 3-є місце
    
    BOYS GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 51,5+ KG
    ВІКТОР АНДРІЄНК 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 48 KG
    НАЗАР ПОПОВ 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 56 KG
    МИХАЙЛО САМЧЕНКО 1-е місце
    
    BOYS GI / WHITE, GREY BELTS / TEEN (15 Y.O.) / 48 KG
    АРТЕМ САВІН 3-є місце
    
    BOYS NO-GI / WHITE, GREY BELTS / INFANT (11 Y.O.) / 51.5+ KG
    ВІКТОР АНДРІЄНКО 2-є місце
    
    BOYS NO-GI / WHITE, GREY BELTS / JUNIOR (12 Y.O.) / 48 KG
    НАЗАР ПОПОВ 1-е місце
    
    BOYS NO-GI / WHITE, GREY BELTS / JUNIOR (13 Y.O.) / 52 KG
    МИХАЙЛО САМЧЕНКО 2-є місце
    
    GIRLS GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 33 KG
    ЮЛИЯ ГЕТЬМАНЕЦ 1-е місце
    ИЗАБЕЛЛА ЕЛЬНИКОВА 2-є місце
    
    GIRLS GI / WHITE, GREY BELTS / INFANT (11 Y.O.) / 42 KG
    ОЛЕКСАНДРА ШКУРО 3-є місце
    
    GIRLS NO-GI / WHITE, GREY BELTS / INFANT (10 Y.O.) / 30 KG
    ЮЛИЯ ГЕТЬМАНЕЦ 1-е місце
    ИЗАБЕЛЛА ЕЛЬНИКОВА 2-є місце`,

    image: news2,
  },
  {
    text: `Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя.

    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image: news3,
  },
  {
    text: ` Тренування дорослої групи.`,
    image: news4,
  },
  {
    text: ` Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.`,
    image: news5,
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: `Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.

Усі учасники турніру продемонстрували свої навички та відвагу, а дитяча команда Yamasaki Academy Dnipro показала найвищий рівень майстерності, який можна очікувати від нашої школи. Ми пишаємось нашими вихованцями та вітаємо їх з успіхами на турнірі!
  `,
  },
];
