import news2 from "../assets/img/newsContentImage/news2.jpg";
import news3 from "../assets/img/newsContentImage/news3.png";
import news4 from "../assets/img/newsContentImage/news4.jpg";
import news5 from "../assets/img/newsContentImage/news5.jpg";
import news6 from "../assets/img/newsContentImage/shahoikoDR.jpg";
import result2 from "../assets/img/newsContentImage/src4.png";
import news7 from "../assets/img/newsContentImage/krivbas-challenge-open-cup-2023.png";
import result1 from "../assets/img/newsContentImage/src3.png";
import result3 from "../assets/img/newsContentImage/src5.png";
import news8 from "../assets/img/newsContentImage/asgard-jiu-jitsu-cup-3-2023.png";
import vova from "../assets/img/newsContentImage/vova.jpg";
import fernandoseminar from "../assets/img/newsContentImage/6786450_orig.jpg";
import autumnCup from "../assets/img/newsContentImage/ukraine-bjj-pro-autumn-cup-2023.jpg";
import result4 from "../assets/img/newsContentImage/RESULT 4.png";
import adultbelt from "../assets/img/newsContentImage/adultbelt.png";
import topguncup from "../assets/img/newsContentImage/topgun-open-cup-2023.png";
import topgunresult from "../assets/img/newsContentImage/topgunresult.png";
import promoadult from "../assets/img/newsContentImage/titleadult.png";
import promokids from "../assets/img/newsContentImage/titlekids.png";
import newbeltkids from "../assets/img/newsContentImage/bjjnewbeltkids.png";
import newyear from "../assets/img/newsContentImage/newyear.png";
import { v4 as uuidv4 } from "uuid";
export const newscontent = [
  {
    id: uuidv4(),
    text: `1 січня 2024 - Друзі, наша академія щиро вітає Вас з Новим 2024 роком!!! Цього року бажаємо Вам: нових перемог, високих досягнень, конкурентних сутичок, більше досвіду та можливості проявити себе, стати найкращою версією себе з минулого року, здобути нові навички, а також подолати ті труднощі з якими зіткнулися у минулому. Також міцного здоров'я, щастя та взаєморозуміння у ваших сім'ях, мирного неба та спокою! До зустрічі на татамі!`,
    image: newyear,
    url: "/news",
  },
  {
    id: uuidv4(),
    text: `9 грудня 2023 року - Друзі, наша академія взяла участь у турнірі TOPGUN: OPEN CUP від ​​академії TopGun у місті Дніпро. Наші учні виступили гідно та показали гарний рівень боротьби, також у цьому турнірі разом із нашими учнями розділив татами інструктор молодшої та підліткової групи – Шерстюк Микола. Наша команда зайняла чимало призових місць та гідно представила нашу академію. Вітаємо наших спортсменів та дякуємо організаторам за проведений захід!`,
    image: topguncup,
    image2: topgunresult,
    url: "https://smoothcomp.com/ua/event/13738",
  },
  {
    id: uuidv4(),
    text: `2 грудня 2023 року - Друзі, у стінах нашої академії пройшла чергова традиційна та грандіонзна подія, присвячена врученню нових пасків, але серед молодшої групи. Наша академія від щирого серця вітає нові кольорові паски в лавах нашої академії. Молодша група багата на перспективних спорстменів, які щоразу на кожному турнірі гідно представляють нашу академію та наших інструкторів. Ми бажаємо їм успіхів, завзятості у тренуваннях, нових яскравих перемог на татамі, більше яскравих сутичок, а також більших можливостей проявити себе!  Вручення пасків проводилося під керівництвом професора нашої академії – Косенко Валентина Михайловича.`,
    image: promokids,
    image2: newbeltkids,
    url: "/news",
  },
  {
    id: uuidv4(),
    text: `13 листопада 2023 - Друзі, у стінах нашої академії пройшла традиційна та урочиста подія, присвячена врученню нових пасків. Наша академія рада вітати нові кольорові паски у наших лавах! Від щирого серця, наша академія вітає спортсменів, а також бажає успіхів, нових перемог, завзятості у тренуваннях і лише високих результатів! Вручення пасків проводилося під керівництвом професора нашої академії – Косенко Валентина Михайловича.`,
    image: promoadult,
    image2: adultbelt,
    url: "/news",
  },
  {
    id: uuidv4(),
    text: `11.11.2023 - Дорогі друзі, сьогодні пройшов турнір у місті Кропивницький Ukraine BJJ Pro Autumn Cup 2023. У якому взяли участь велика кількість клубів із різних міст. Хочемо подякувати організаторам за якісно проведений захід, а також привітати учасників, їхніх тренерів та батьків. Також хочемо привітати наших спортсменів із відмінним виступом та заняттям великої кількості призових місць. Незважаючи на велику кількість учасників та сутичок, наші учні змогли показати високий рівень боротьби та гідно представити нашу академію! Вітаємо спортсменів!`,
    image: autumnCup,
    image2: result4,
    url: "https://smoothcomp.com/en/event/13180",
  },
  {
    id: uuidv4(),
    text: `Дорогі друзі, хочемо повідомити про унікальну подію. 21 жовтня, о 18:00 у стінах нашої академії, пройде онлайн-семінар під керівництвом Професора Ямасакі Академії – Фернандо Ямасакі. Будемо раді всім охочим!`,
    image: fernandoseminar,
  },
  {
    id: uuidv4(),
    text: `10 жовтня 2023 року відзначає своє День народження один із найяскравіших представників нашої академії – Володимир Гончар. Наша академія хоче від щирого серця привітати Володимира, а також побажати міцного здоров'я, успіхів у творчості, на татамі і в житті!`,
    image: vova,
  },
  {
    id: uuidv4(),
    text: `07 жовтня 2023 року наша Академія взяла участь у турнірі Asgard Jiu-Jitsu Cup-3, який проходив у місті Кривий Ріг. Наша академія вітає всіх спортсменів, які взяли участь, дякує організаторам за якісно проведений турнір, а також хоче привітати всіх наших спортсменів із призовими місцями!`,
    image: news8,
    image2: result3,
    url: "/news",
  },
  {
    id: uuidv4(),
    text: `23 вересня 2023 року у м. Кривий Ріг пройшов турнір KRIVBAS CHALLENGE OPEN CUP. Наша академія
вітає учасників із перемогою та зайнятими призовими місцями, а також раді привітати з другим командним призовим місцем!`,
    image: news7,
    image2: result1,
    url: "https://smoothcomp.com/en/event/13005",
  },
  {
    id: uuidv4(),
    text: `Наша академія від щирого серця хоче привітати Шагойко Юрія Васильовича з Днем народження!! Бажаємо міцного здоров'я, мирного неба над головою, побільше світлих днів і любові, успіхів на татамі і в боротьбі!`,
    image: news6,
  },
  {
    id: uuidv4(),
    text: ` 29 липня 2023 року в місті Кропивницький відбувся турнір UKRAINE BJJ PRO SUMMER CUP 2023, в якому взяла участь наша команда у складі дитячого дивізіону.
    Маємо наступні результати:  
    `,
    image: news2,
    image2: result2,
    url: "https://smoothcomp.com/en/event/11870",
  },
  {
    id: uuidv4(),
    text: `Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя.

    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image: news3,
  },
  { id: uuidv4(), text: ` Тренування дорослої групи.`, image: news4 },
  {
    id: uuidv4(),
    text: ` Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях. `,
    image: news5,
  },
];
