import senya from "../assets/img/senya.jpg";
import senya2 from "../assets/img/senya2.jpg";
import red from "../assets/img/red.jpg";
export const slides = [
  {
    img: "https://wallpapercave.com/wp/wp1955454.jpg",
    label: " Що таке бразильське джиу-джитсу?",
    description: ` 
    Бразильське джиу-джитсу (англ. Brazilian Jiu-Jitsu, BJJ) - це бойовий спорт і система бойових мистецтв, які розвинулися в Бразилії, особливо в Сан-Паулу, в середині 20 століття. BJJ відоме своєю ефективністю в ближньому бою і граційних техніках, які дозволяють меншому або менше фізично підготовленому бійцю перемогти супротивника, який фізично сильніший або більш досвідчений.
 `,
  },
  {
    img: "https://wallpapercave.com/wp/wp1874967.jpg",
    label: "Переваги тренувань BJJ!",
    description: `Джіу-джитсу - це: саморозвиток, тренування з філософією та розумінням фундаментальних речей, антистрес, найпотужніше спортивне ком'юніті, сімейний вид спорту та сімейна атмофсера у стінах академії, один із найефективніших засобів самозахисту, повага та дисципліна.
     `,
  },
  {
    img: red,
    label: "Що вам буде потрібно для тренувань?",
    description: `Бути старше 6 років, не мати заборон від лікарів для
      заняття спортом, мати бажання, настрій, амбіції та
      екіпірування.`,
  },
  {
    img: "https://th.bing.com/th/id/R.669c330024dc6b0f8c7018baaae90976?rik=1oBjHDDoPV5%2btA&pid=ImgRaw&r=0",
    label: " Екіпірування для Gi формату",
    description: `Kimono / Gi (гі) — куртка, штани, пояс кольору вашого
    рівня (початковий рівень – білий пояс). Також можна
    надягнути рашгард під куртку. Для жінок рашгард
    обов’язковий.     `,
  },
  {
    img: "https://vhx.imgix.net/atoslive/assets/bad0248e-7500-48b8-a2c9-5cf25e38d93c.jpg?auto=format%2Ccompress&fit=crop&h=720&w=1280",
    label: " Екіпірування для No-Gi формату",
    description: `    Sem Kimono / No Gi (без гі) — шорти, щільно обтягуючі
    штани та рашгард (“rash guard” – футболка зі
    спеціального матеріалу, що захищає від поту; може бути
    як з довгим, так і з коротким рукавом)`,
  },
  {
    img: "https://th.bing.com/th/id/R.f80fb7be75b61f6248fe3059de328379?rik=GIHlY7qKcU6%2f%2fg&pid=ImgRaw&r=0",
    label: "   Формати тренувань.",
    description: `   Формат нашого тренування: розминка, можлива невелика
    дрілл-сесія, розбір технік – відпрацювання, практика –
    боротьба 3-6 раундів по 5 хвилин. Також по суботах в нашій академії проходить тренування в форматі «день боротьби». Все тренування присвячено тільки практиці і боротьбі.`,
  },
];
