import korot from "../../src/assets/img/korot.jpg";
import red from "../../src/assets/img/red.jpg";
import kirillKudr from "../../src/assets/img/kirillKudr.jpg";
import lesha from "../../src/assets/img/lesha.jpg";
import kor from "../../src/assets/img/kor.jpg";
import andrei from "../../src/assets/img/andrei.jpg";
import zaika from "../../src/assets/img/zaika.jpg";
import { Icon, Text } from "@chakra-ui/react";
import elnikova from "../../src/assets/img/elnikova.jpg";
import Smile from "../assets/img/Kolya.jpg";
import Coach from "../assets/img/coach1.png";
import vlad from "../assets/img/vlados.jpg";
import kids from "../assets/img/kids.jpg";
import guysnogi from "../assets/img/guysnogi.jpg";
import river from "../assets/img/vizit.png";
import integralseminar from "../assets/img/integralseminar.png";
import { FaTelegram, FaInstagram } from "react-icons/fa";
import { GiBlackBelt, GiPunchBlast } from "react-icons/gi";
import localTour from "../assets/img/localtour.jpg";
import newbeltskids from "../assets/img/newbeltskids.jpg";
import {
  FcGraduationCap,
  FcBullish,
  FcConferenceCall,
  FcLike,
  FcChargeBattery,
  FcHome,
} from "react-icons/fc";
export const Class = [
  {
    heading: "BJJ / MMA",
    title: "Діти",
    age: "6-9 років",
    features: [
      "Формати Gi/No-Gi",
      "Вивчення базових технік та основ BJJ/MMA",
      "Вивчення теорії, drill сесії, спаринги",
      "Розвиток дисципліни, поваги та самовпевненості",
    ],
    color: "#3f48cc",
  },
  {
    heading: "BJJ / MMA",
    title: "Підлітки",
    age: "10-15 років",
    features: [
      "Формати Gi/No-Gi",
      "Вивчення просунутих технік BJJ/MMA",
      "Роз'яснення деталей, вільні та позиційні спаринги",
      "Пояснення ключових цінностей",
    ],
    color: "purple",
  },
  {
    heading: "BJJ / MMA",
    title: "Дорослі",
    age: "Раді всім",
    features: [
      "Формати Gi/No-Gi",
      "Вивчення концепцій та методів змагального BJJ",
      "Вільні спаринги, drill сесії, боротьба за завданням",
      "Сесії питання - відповідь",
    ],
    color: "brown",
  },
];

export const cards = [
  {
    img: integralseminar,
  },
  {
    img: river,
  },
  {
    img: kids,
  },
  {
    img: guysnogi,
  },
  {
    img: red,
  },
  {
    img: korot,
  },
  {
    img: kirillKudr,
  },
  {
    img: lesha,
  },
  {
    img: newbeltskids,
  },
  {
    img: kor,
  },
  {
    img: andrei,
  },
  {
    img: zaika,
  },
  {
    img: elnikova,
  },
  {
    img: localTour,
  },
];

export const Advantage = [
  {
    heading: "Професійність",
    icon: <Icon as={FcGraduationCap} w={10} h={10} />,
    description:
      "Ми відповідально ставимося до навчання та ставимо у пріоритет пояснення ключових принципів!",
  },
  {
    heading: "Товариство",
    icon: <Icon as={FcConferenceCall} w={10} h={10} />,
    description:
      "Вперше вступивши на татамі, ви приєднуєтеся до найпотужнішого спортивного ком'юніті!",
  },
  {
    heading: "Розвиток",
    icon: <Icon as={FcBullish} w={10} h={10} />,
    description:
      "BJJ є одним з найкращих інструментів для саморозвитку та становлення особистості!",
  },
  {
    heading: "Самозахист",
    icon: <Icon as={FcLike} w={10} h={10} />,
    description:
      "Ви освоїте навички та техніки одного з найкращих засобів самозахисту!",
  },
  {
    heading: "Джерело енергії",
    icon: <Icon as={FcChargeBattery} w={10} h={10} />,
    description:
      "Ви відкриєте для себе найефективніше джерело антистресу та нового заряду енергії!",
  },
  {
    heading: "Велика родина",
    icon: <Icon as={FcHome} w={10} h={10} />,
    description:
      "Yamasaki - це сімейний вид спорту в дружній атмосфері, де батьки тренуюся з дітьми пліч-о-пліч!",
  },
];
export const Question = [
  {
    question: "Чи можу я / моя дитина займатися BJJ?",
    answer:
      "Звичайно, якщо ви старше 6 років, не маєте протипоказань, а маєте бажання! Зв'яжіться з нами будь-яким зручним для Вас способом і попередьте про візит.",
  },
  {
    question: "Що мені потрібно для першого тренування?",
    answer:
      "Для першого тренування, Вам знадобиться: змінне взуття, футболка та шорти без змійок, за наявності рашгард, легінси та Гі (кімоно), також душове приладдя та гарний настрій. Також з метою безпеки, як своєї, так і партнерів, перед тренуванням знімайте особисті прикраси, кільця, сережки, пірсинг або подібне.",
  },
  {
    question: "Чи можу я прийняти душ після тренування?",
    answer:
      "Звичайно, у кожній роздягальні є душ. Тому не забудьте засоби особистої гігієни.",
  },
  {
    question: "Що я отримаю від першого пробного тренування?",
    answer:
      "Перше заняття – ознайомче. Ви познайомитеся з командою та інструкторами, програмою навчання, спробуєте повторити основні вправи та техніки. Ви можете не турбуватися за травми, хоч BJJ і виглядає як небезпечний вид спорту, але у нас чудовий і дружний колектив, який з розумінням та відповідальністю ставиться до новачків!",
  },
  {
    question: "Чи є якісь правила, які я маю знати?",
    answer:
      "Як таких правил немає, ми раді всім і кожному, хто вирішив відвідати нас. Ми з повагою ставимося до всіх, поважаємо стіни нашої академії та наших інструкторів, стежимо за чистотою, як на татамі, так і за особистою гігієною, завжди раді допомогти чи дати пораду, у стінах нашої академії немає місця сорому чи страху перед питаннями, ми завжди раді відповісти чи підказати.",
  },
  {
    question: "Мені обов'язково одразу купувати Гі?",
    answer:
      "Відразу купувати необов'язково, якщо ми матимемо вільний комплект, ми надамо Вам його для тренування.",
  },
  {
    question: "Чи можна прийти з другом/подругою, чи можна дівчатам?",
    answer: "    Звісно, ​​будемо раді бачити Вас у стінах нашої академії! ",
  },
];
export const InstructorsInfo = [
  {
    name: "Косенко Валентин Михайлович",
    title: "Професор",
    description:
      "Професор та головний інструктор Ямасакі Академії. Займається підготовкою та навчанням старшої групи. Також є суддею турнірів з Бразильського джіу-джитсу.",
    role: "Інструктор дорослої групи",
    experience: "Практикує джиу-джитсу 12 років",
    imageSrc: Coach,
    beltColor: "Коричневий пасок",
    belt: "brown",
    icon: <Icon as={GiBlackBelt} color={"white"} w={8} h={8} />,
  },
  {
    name: "Шерстюк Микола Васильович",
    title: "Інструктор",
    description:
      "Інструктор підліткової та дитячої групи з Бразильського джиу джитсу. Займається підготовкою молодших груп до змагань та турнірів.",
    beltColor: "Пурпурний пасок",
    role: "Інструктор підліткової та дитячої групи",
    experience: "Практикує джиу-джитсу 8 років",
    imageSrc: Smile,
    belt: "purple",
    icon: <Icon as={GiBlackBelt} color={"white"} w={8} h={8} />,
  },
  {
    name: "Мирошников Владислав Ігорович",
    title: "Інструктор",
    description:
      "Досвідчений тренер з ММА та Бойового самбо . Практикує бразильське джиу-джитсу.",
    beltColor: "Володіє навичками кількох дисциплін бойових мистецтв",
    role: "Інструктор підліткової та дитячої групи",
    experience: "Практикує ММА та Бойове самбо 6 років",
    imageSrc: vlad,
    belt: "white",
    icon: <Icon as={GiPunchBlast} color={"black"} w={8} h={8} />,
  },
];
export const socialButtonsData = [
  {
    label: "Telegram",
    href: "https://t.me/+JZvRQ-LtbyU1OWEy",
    icon: <FaTelegram />,
  },
  {
    label: "Instagram",
    href: "https://instagram.com/bjj_kids_dnipro?igshid=MzRlODBiNWFlZA==",
    icon: <FaInstagram />,
  },
  {
    label: "Telegram",
    href: "https://t.me/YamasakiAcademyDnipro",
    icon: <FaTelegram />,
  },
];
export const statData = [
  {
    id: 1,
    label: "Дитяча група BJJ : 15:30 - 17:00",
    label2: "Підліткова група BJJ : 17:00 - 18:30",
    label3: "Доросла група BJJ: 18:45 - 20:45",
    score: "Понеділок",
  },
  {
    id: 2,
    label: "Підліткова група MMA : 17:00 - 18:30",
    score: "Вівторок",
  },
  {
    id: 3,
    label: "Дитяча група BJJ : 15:30 - 17:00",
    label2: "Підліткова група BJJ : 17:00 - 18:30",
    label3: "Доросла група BJJ: 18:45 - 20:45",
    score: "Середа",
  },
  {
    id: 4,
    label: "Підліткова група MMA : 17:00 - 18:30",
    score: "Четвер",
  },
  {
    id: 5,
    label: "Дитяча група BJJ : 15:30 - 17:00",
    label2: "Підліткова група BJJ : 17:00 - 18:30",
    label3: "Доросла група BJJ: 18:45 - 20:45",
    score: "П'ятниця",
  },
  {
    id: 6,
    label: "Доросла група BJJ: 09:00 - 11:00",
    score: "Субота",
  },
];
export const InstructorsPhone = [
  {
    name: "Шерстюк Микола",
    category: "Інструктор підліткової та дитячої групи ",
    phone: "+380 73 203 76 64",
  },
  {
    name: "Косенко Валентин",
    category: "Професор академії та інструктор  групи  ",
    phone: "+380 50 535 09 61",
  },
  {
    name: "Мирошников Владислав",
    category: "Інструктор з ММА та Бойового самбо ",
    phone: "+380 95 507 33 70",
  },
];
export const SocialLinksContacts = [
  {
    href: "https://t.me/+JZvRQ-LtbyU1OWEy",
    heading: "Yamasaki News",
    icon: <Icon as={FaTelegram} w={10} h={10} />,
    description: "Наша група з новинами та оголошеннями.",
  },
  {
    href: "https://instagram.com/bjj_kids_dnipro?igshid=MzRlODBiNWFlZA==",
    heading: "Yamasaki Dnipro Kids",
    icon: <Icon as={FaInstagram} w={10} h={10} />,
    description: "Сторінка дитячої та підліткової групи BJJ.",
  },
  {
    href: "https://t.me/YamasakiAcademyDnipro",
    heading: "Yamasaki FAQ",
    icon: <Icon as={FaTelegram} w={10} h={10} />,
    description: "Якщо у вас є питання, можете поставити їх особисто!",
  },
];
export const buttons = [
  {
    label: "Контакти",
    id: "InstructorContact",
    colorScheme: "red",
    bgColor: "blue.400",
  },
  {
    label: "Соцмережі",
    id: "Society",
  },
];
export const buttonShedule = [
  {
    label: "Контакти",
    id: "InstructorContact",
    colorScheme: "red",
    bgColor: "blue.400",
  },
  {
    label: "Записатись",
    id: "telegram",
  },
];

export const ContainerData = [
  {
    headingText: "Твій шлях",
    headingText1: " - до нас!",
    street: "Вулиця: Тимчасова, 2А",
    locationInfo: "Зупинка: вулиця Богдана Хмельницького",
    bus: "Маршрути автобусів: A153, 124A, A115, A149, A64Г, А31, А177,А107, А136, А88, А38, А43, А158 ",
    trolley: " Маршрути тролейбусів: 20,7, 17, 3, 15",
    bgColor: "blue.400",
    mapEmbedURL:
      "https://www.google.com/maps/embed?pb=!1m14!1m8!1m3!1d1321.7486555802132!2d35.0736516!3d48.5045306!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40dbe393edb25bcb%3A0xe91e1f026da0b37e!2sYamasaki%20Academy%20Jiu%20Jitsu!5e0!3m2!1sru!2sua!4v1694594361759!5m2!1sru!2sua",
  },
  {
    headingText: "Якщо загубився",
    headingText1: " – подивися!",
    locationInfo: "Нас не так просто знайти, як здається!  ",
    bus: "Тому ми спеціально для тебе записали відеомаршрут!",
    trolley:
      " Якщо виникнуть запитання, ви можете зв'язатися з одним із інструкторів для уточнення інформації.",
    mapEmbedURL:
      "https://www.youtube.com/embed/XyQ27GXavDM?si=ixaPX6BKhdyfrQ8b",
    bgColor: "red.400",
  },
];
export const testimonialsData = [
  {
    heading: "",
    text: "Крутой талантливый тренер.  Удобное расположение зала, новый, очень удобный. Сын каждую тренировку ждёт с нетерпением! Занимаемся 1,5 года на одном дыхании. Мне, как маме, очень нравится наблюдать за успехами ребёнка. Борьба воспитывает волю и дух, учит быть предприимчивым и быстро принимать решения, конечно же развивает физически)",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: "Диана Самченко",
      title: " ",
    },
  },
  {
    heading: " ",
    text: "Если вы хотите научится БЖЖ то вам сюда. Очень нравится то что теория совмещается с практикой, борьба почти каждую тренировку. Суббота 'день борьбы', 2 часа борьбы с разными соперниками.",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: "Максим Хижняк",
      title: " ",
    },
  },
  {
    heading: " ",
    text: "Рекомендуем, ребенок бежит на тренировки, ходим уже 3-й год.Как кто то нидеде написал, это не просто тренировки,это действительно большая дружная семья.Спасибо,что Вы есть💪👍",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: " Яна Козачок",
      title: " ",
    },
  },
  {
    heading: " ",
    text: "Отличный клуб бразильского джиу джитсу! Что нравиться больше всего - возможность начать занятия в любом возрасте (я начал в 25 лет), есть детские группы. Особенно нужно выделить профессионализм тренеров, сплоченность коллектива и дружественную обстановку в зале. Отличный зал по BJJ в Днепре.",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: "Сергей Коротич",
      title: " ",
    },
  },
  {
    heading: " ",
    text: "Отличная школа джиу-джитсу.Крутые тренера, группы для разных возрастов (есть детские), атмосфера поддержки и взаимоуважения на тренировках и соревнованиях.И немаловажно – современный и хорошо оборудованный зал.Сын ждет тренировок с нетерпением и занимается с удовольствием. Рекомендую всем.",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: "Данил Самченко",
      title: " ",
    },
  },
  {
    heading: " ",
    text: "Рекомендуем всем,отличная спортивная секция,ходит сын третий год,нравится очень ,уже и правда стали как семья все)В первую очередь это заслуга нашего любимого тренера, первоклассного мастера своего дела!!!!",
    avatar: {
      src: "https://images.unsplash.com/photo-1586297135537-94bc9ba060aa?ixid=MXwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHw%3D&ixlib=rb-1.2.1&auto=format&fit=crop&w=100&q=80",
      name: "Лариса Гончар",
      title: " ",
    },
  },
];

export const AboutAcdemy = (
  <Text
    color={"black"}
    fontSize={{ base: "lg", sm: "lg " }}
    textAlign={"center"}
  >
    Yamasaki Academy Jiu Jitsu Dnipro є представництвом міжнародної школи
    вивчення бразильського джиу-джитсу.
    <br />
    <br />В даний час академія Ямасакі має кілька шкіл джиу-джитсу і філій
    академій єдиноборств у Сполучених Штатах, Бразилії, Домініканській
    Республіці, Іспанії, Швеції та Україні.
    <br />
    <br /> Yamasaki Academy є одним з провідних клубів бразильського джиу-джитсу
    в світі. Заснована у 1981 році, Yamasaki Academy виховала багато відомих
    чемпіонів у світі бойових мистецтв. Клуби Yamasaki Academy працюють за
    певним підходом до тренувань, який включає в себе розвиток фізичної та
    ментальної сили, техніки бойового мистецтва, спаринги та інші елементи.
    <br />
    <br /> Yamasaki Academy має офіційний статус члена міжнародних федерацій
    бразильського джиу-джитсу IBJJF, AJP та української федерації UFBJJ.
    <br />
    <br /> Основними цілями нашої академії є розвиток та популяризація
    бразильського джиу-джитсу в Україні, всебічне вивчення всіх аспектів даного
    бойового мистецтва, а також популяризація здорового способу життя серед
    молоді та дорослих.
    <br />
    <br /> Бразильський джиу-джитсу - це високоінтенсивний вид спорту, який
    допомагає розвивати фізичну та ментальну витривалість, впевненість та
    самодисципліну. Якщо ви цікавитеся бразильським джиу-джитсу, то Yamasaki
    Academy може бути одним з варіантів для початку тренувань.
  </Text>
);
