import news1 from "../../assets/img/newsContentImage/news1.jpg";
import news2 from "../../assets/img/newsContentImage/news2.jpg";
import news3 from "../../assets/img/newsContentImage/news3.png";
import news4 from "../../assets/img/newsContentImage/news4.jpg";
import news5 from "../../assets/img/newsContentImage/news5.jpg";
import { Image } from "@chakra-ui/react";
export const newscontent = [
  {
    text: `Джиу-джитсу для дітей: Ключ до Фізичного та Розумового Розвитку`,
    image: news1,
  },
  {
    text: ` 29 липня 2023 року в місті Кропивницький відбувся турнір UKRAINE BJJ PRO SUMMER CUP 2023, в якому взяла участь наша команда у складі дитячого дивізіону.`,

    image: news2,
  },
  {
    text: `Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя.

    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image: news3,
  },
  {
    text: ` Тренування дорослої групи.`,
    image: news4,
  },
  {
    text: ` Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.`,
    image: news5,
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: ` Сьогодні свій День народження святкує один з компетиторів Гудзенко Костя. 
    З нагоди твого Дня народження щиро вітаємо тебе зі святом! 🎉🎂`,
    image:
      "https://bjj-dnipro.com/media/photos/2023/07/24/299381672_587385963110299_2881757756871189388_n.png",
  },
  {
    text: `Напередодні, 14.05.2023, дитяча група Yamasaki Academy Dnipro брала участь у турнірі з Бразильського джиу-джитсу. Наші вихованці показали вражаючі результати, здобувши кілька перемог та посідаючи високі місця в своїх вагових категоріях.

Усі учасники турніру продемонстрували свої навички та відвагу, а дитяча команда Yamasaki Academy Dnipro показала найвищий рівень майстерності, який можна очікувати від нашої школи. Ми пишаємось нашими вихованцями та вітаємо їх з успіхами на турнірі!
  `,
  },
];
